tap "homebrew/autoupdate"

# Core CLI
brew "coreutils"
brew "grep"
brew "jq"
brew "rsync"
brew "sevenzip"
brew "watch"
brew "wget"
brew "zsh"

# Dev tools
brew "act"              # Run GitHub Actions locally
brew "biome"            # JS/TS linter + formatter
brew "direnv"
brew "fzf"
brew "gdu"              # Disk usage analyzer
brew "gh"
brew "git"
brew "git-lfs"
brew "jj"               # Jujutsu VCS
brew "mise"
brew "shellcheck"
brew "trufflehog"       # Secret scanner

# Languages & runtimes
brew "cargo-binstall"
brew "python@3.13"
# req. for mise to build ruby@3
brew "libyaml"

# Database
brew "libpq"

# Containers & infrastructure
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "opentofu"
brew "pulumi"

# Networking
brew "croc"             # File transfer
brew "fastly"
brew "mtr"              # Network diagnostics
brew "nmap"

# AI
brew "ollama", restart_service: :changed

# Media
brew "devil"            # Image library
brew "ffmpeg"
brew "yt-dlp"

# Casks
cask "1password-cli"
cask "bruno"            # API client
cask "claude-code"
cask "iterm2"
cask "lagrange"         # Gemini browser
cask "orbstack"         # Docker/Linux VMs
cask "qmk-toolbox"     # Keyboard firmware
cask "visual-studio-code@insiders"
cask "xcodes-app"
