tap "hashicorp/tap"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
brew "cmake"
brew "coreutils"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "gcc"
brew "git-lfs"
brew "llvm"
brew "minikube"
brew "mtr"
brew "pyenv"
brew "rbenv"
brew "rsync"
brew "watch"
brew "wget"
brew "zsh"
brew "hashicorp/tap/terraform"
cask "orbstack"