tap "homebrew/autoupdate"
tap "homebrew/bundle"
brew "act"
brew "biome"
brew "cairo"
brew "cargo-binstall"
brew "ccache"
brew "cmake"
brew "coreutils"
brew "croc"
brew "devil"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "fastly"
brew "ffmpeg"
brew "fzf"
brew "gdu"
brew "gh"
brew "git"
brew "git-lfs"
brew "grep"
brew "helm"
brew "jj"
brew "jq"
brew "libpq"
# req. for mise to build ruby@3
brew "libyaml"
brew "mise"
brew "mtr"
brew "ninja"
brew "nmap"
brew "ollama", restart_service: :changed
brew "opentofu"
brew "pixman"
brew "pulumi"
brew "python@3.13"
brew "rsync"
brew "sevenzip"
brew "shellcheck"
brew "skaffold"
brew "trufflehog"
brew "watch"
brew "wget"
brew "yt-dlp"
brew "zsh"
cask "1password-cli"
cask "android-platform-tools"
cask "bruno"
cask "claude-code"
cask "gcloud-cli"
cask "iterm2"
cask "lagrange"
cask "orbstack"
cask "qmk-toolbox"
cask "visual-studio-code@insiders"
cask "xcodes"
cask "xcodes-app"
