anthropic.claude-code
crystal-spider.jsdoc-generator
dbaeumer.vscode-eslint
esbenp.prettier-vscode
github.vscode-github-actions
kevinrose.vsc-python-indent
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.vscode-typescript-next
redhat.vscode-yaml
tamasfe.even-better-toml
typescriptteam.native-preview
