anthropic.claude-code
github.vscode-github-actions
github.vscode-pull-request-github
redhat.vscode-yaml
tamasfe.even-better-toml
typescriptteam.native-preview
ziglang.vscode-zig
redhat.vscode-xml
docker.docker
jjk.jjk
svelte.svelte-vscode
